Catalogs/BusinessActivities.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.1">
	<Catalog>
		<Properties>
			<Name>BusinessActivities</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>GLAccountRevenueFromSales</Name>
					<Type>
						<v8:Type>cfg:ChartOfAccountsRef.Managerial</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>GLAccountCostOfSales</Name>
					<Type>
						<v8:Type>cfg:ChartOfAccountsRef.Managerial</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ProfitGLAccount</Name>
					<Type>
						<v8:Type>cfg:ChartOfAccountsRef.Managerial</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

AccumulationRegisters/IncomeAndExpenses.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.1">
	<AccumulationRegister>
		<Properties>
			<Name>IncomeAndExpenses</Name>
			<RegisterType>Turnovers</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>AmountIncome</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>AmountExpense</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ContentOfAccountingRecord</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Company</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Companies</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>StructuralUnit</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.StructuralUnits</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>BusinessActivity</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.BusinessActivities</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>CustomerOrder</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.CustomerOrder</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>GLAccount</Name>
					<Type>
						<v8:Type>cfg:ChartOfAccountsRef.Managerial</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

Enums/GLAccountsTypes.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.1">
	<Enum>
		<Properties>
			<Name>GLAccountsTypes</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>DepreciationFixedAssets</Name>
					<Comment>02</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>FixedAssets</Name>
					<Comment>01</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>AccountsGroup</Name>
					<Comment>Service</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Debitors</Name>
					<Comment>62.01, 60.02, 68.02, 71.02</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>CashAssets</Name>
					<Comment>50, 51, 57</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>LongtermObligations</Name>
					<Comment>67</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Incomings</Name>
					<Comment>90.01</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Inventory</Name>
					<Comment>10, 41</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Capital</Name>
					<Comment>80</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>IndirectExpenses</Name>
					<Comment>25</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ShorttermInvestments</Name>
					<Comment>58</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Creditors</Name>
					<Comment>60.01, 62.02, 68.01, 70.01, 71.01</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>CreditsAndLoans</Name>
					<Comment>66</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ProfitTax</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>UnfinishedProduction</Name>
					<Comment>20</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>UndistributedProfit</Name>
					<Comment>84</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ProfitLosses</Name>
					<Comment>99</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>CreditInterestRates</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>OtherFixedAssets</Name>
					<Comment>08</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>OtherIncome</Name>
					<Comment>90.01</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>OtherShorttermObligations</Name>
					<Comment>98</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>OtherCurrentAssets</Name>
					<Comment>94, 97</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>OtherExpenses</Name>
					<Comment>91.02</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Expenses</Name>
					<Comment>90.07, 90.08</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ReserveAndAdditionalCapital</Name>
					<Comment>82</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>CostOfGoodsSold</Name>
					<Comment>90.02</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>TradeMarkup</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

ChartsOfAccounts/Managerial.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.1">
	<ChartOfAccounts>
		<Properties>
			<Name>Managerial</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>TypeOfAccount</Name>
					<Type>
						<v8:Type>cfg:EnumRef.GLAccountsTypes</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>MethodOfDistribution</Name>
					<Type>
						<v8:Type>cfg:EnumRef.CostingBases</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ClosingAccount</Name>
					<Type>
						<v8:Type>cfg:ChartOfAccountsRef.Managerial</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>GLAccounts</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>GLAccount</Name>
							<Type>
								<v8:Type>cfg:ChartOfAccountsRef.Managerial</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<AccountingFlag>
				<Properties>
					<Name>Currency</Name>
					<Comment>Currency</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</AccountingFlag>
		</ChildObjects>
	</ChartOfAccounts>
</MetaDataObject>

Catalogs/BusinessActivities/Forms/GLAccountsEditForm/Ext/Form/Module.bsl
////////////////////////////////////////////////////////////////////////////////
// GENERAL PURPOSE PROCEDURES AND FUNCTIONS

// Function checks account change option.
//
&AtServer
Function DenialChangeGLAccounts(BusinessActivity)
	
	Query = New Query(
	"SELECT TOP 1
	|	IncomeAndExpenses.Period,
	|	IncomeAndExpenses.Recorder,
	|	IncomeAndExpenses.LineNumber,
	|	IncomeAndExpenses.Active,
	|	IncomeAndExpenses.Company,
	|	IncomeAndExpenses.StructuralUnit,
	|	IncomeAndExpenses.BusinessActivity,
	|	IncomeAndExpenses.CustomerOrder,
	|	IncomeAndExpenses.GLAccount,
	|	IncomeAndExpenses.AmountIncome,
	|	IncomeAndExpenses.AmountExpense,
	|	IncomeAndExpenses.ContentOfAccountingRecord
	|FROM
	|	AccumulationRegister.IncomeAndExpenses AS IncomeAndExpenses
	|WHERE
	|	IncomeAndExpenses.BusinessActivity = &BusinessActivity");
	
	Query.SetParameter("BusinessActivity", BusinessActivity);
	
	Result = Query.Execute();
	
	Return Not Result.IsEmpty();
	
EndFunction // DenialChangeRevenueGLAccountFromSales()

////////////////////////////////////////////////////////////////////////////////
// PROCEDURE - FORM EVENT HANDLERS

// Procedure - event handler OnCreateAtServer of the form.
//
&AtServer
Procedure OnCreateAtServer(Cancel, StandardProcessing)
	
	GLAccountRevenueFromSales = Parameters.GLAccountRevenueFromSales;
	GLAccountCostOfSales = Parameters.GLAccountCostOfSales;
	ProfitGLAccount = Parameters.ProfitGLAccount;
	BusinessActivity = Parameters.Ref;
	
	If DenialChangeGLAccounts(BusinessActivity) Then
		Items.GLAccountsGroup.ToolTip = NStr("en = 'There are incomes or expenses in the base by this activity! Change of the sales revenue GL account is prohibited!'");
		Items.GLAccountsGroup.Enabled = False;
		Items.Default.Visible = False;
	EndIf;
	
	If Parameters.Ref = Catalogs.BusinessActivities.Other Then
		
		NewParameter = New ChoiceParameter("Filter.TypeOfAccount", Enums.GLAccountsTypes.OtherIncome);
		NewArray = New Array();
		NewArray.Add(NewParameter);
		NewParameters = New FixedArray(NewArray);
		Items.GLAccountRevenueFromSales.ChoiceParameters = NewParameters;
		
		NewParameter = New ChoiceParameter("Filter.TypeOfAccount", Enums.GLAccountsTypes.OtherExpenses);
		NewArray = New Array();
		NewArray.Add(NewParameter);
		NewParameters = New FixedArray(NewArray);
		Items.GLAccountCostOfSales.ChoiceParameters = NewParameters;
		
	Else
		
		NewParameter = New ChoiceParameter("Filter.TypeOfAccount", Enums.GLAccountsTypes.Incomings);
		NewArray = New Array();
		NewArray.Add(NewParameter);
		NewParameters = New FixedArray(NewArray);
		Items.GLAccountRevenueFromSales.ChoiceParameters = NewParameters;
		
		NewParameter = New ChoiceParameter("Filter.TypeOfAccount", Enums.GLAccountsTypes.CostOfGoodsSold);
		NewArray = New Array();
		NewArray.Add(NewParameter);
		NewParameters = New FixedArray(NewArray);
		Items.GLAccountCostOfSales.ChoiceParameters = NewParameters;
		
	EndIf;
	
EndProcedure // OnCreateAtServer()

////////////////////////////////////////////////////////////////////////////////
// PROCEDURE - ACTIONS OF THE FORM COMMAND PANELS

// Procedure - command click handler Default.
//
&AtClient
Procedure Default(Command)
	
	GLAccountRevenueFromSales = PredefinedValue("ChartOfAccounts.Managerial.SalesRevenue");
	GLAccountCostOfSales = PredefinedValue("ChartOfAccounts.Managerial.CostOfGoodsSold");
	ProfitGLAccount = PredefinedValue("ChartOfAccounts.Managerial.ProfitsAndLossesWithoutProfitTax");
	NotifyAccountChange();
	
EndProcedure // Default()

&AtClient
Procedure GLAccountRevenueFromSalesOnChange(Item)
	
	If Not ValueIsFilled(GLAccountRevenueFromSales) Then
		GLAccountRevenueFromSales = PredefinedValue("ChartOfAccounts.Managerial.SalesRevenue");
	EndIf;
	NotifyAccountChange();
	
EndProcedure

&AtClient
Procedure GLAccountCostOfSalesOnChange(Item)
	
	If Not ValueIsFilled(GLAccountCostOfSales) Then
		GLAccountCostOfSales = PredefinedValue("ChartOfAccounts.Managerial.CostOfGoodsSold");
	EndIf;
	NotifyAccountChange();
	
EndProcedure

&AtClient
Procedure ProfitGLAccountOnChange(Item)
	
	If Not ValueIsFilled(ProfitGLAccount) Then
		ProfitGLAccount = PredefinedValue("ChartOfAccounts.Managerial.ProfitsAndLossesWithoutProfitTax");
	EndIf;
	NotifyAccountChange();
	
EndProcedure

&AtClient
Procedure NotifyAccountChange()
	
	ParameterStructure = New Structure(
		"GLAccountRevenueFromSales, GLAccountCostOfSales, ProfitGLAccount",
		GLAccountRevenueFromSales, GLAccountCostOfSales, ProfitGLAccount
	);
	
	Notify("ActivityAccountsChanged", ParameterStructure);
	
EndProcedure
